/******************************************************************************

Задание: (5*28)                                 Ограничения: [-6.5; 6.5]
5) -9804x^32 + 4423,3x^16 - 8,7654x^8
            = ((-9804x^{16} + 4423.3)x^8 - 8.7654) x^8
28) 9,09x^9 - 9,09x^3 + 9,09x
            = (x^6 - 1) x^2 + 1) 9.09x

Автор: Егор Даричев (гр. 4352)                  Версия: 1.3.7

Даты: начало: 04.09.2024                        конец: завтра

*******************************************************************************/

#include <cstdio>

int main()
{
    float x, P1, P2;
    const float a1 = -9804, b1 = 4423.3, c1 = -8.7654, a2 = 9.09;
    printf(
        "%s\n%s\n%s\n%s\n%s\n%s",
        "Задание: P1(x) = -9804x^32 + 4423,3x^16 - 8,7654x^8",
        "P2(x) = 9,09x^9 - 9,09x^3 + 9,09x",
        "P1(x) * P2(x)",
        "Версия: 1.3.7",
        "Автор: Егор Даричев (гр. 4352)",
        "Введите x [-6.5; 6.5]: "
    );
    scanf("%f", &x);

    const float x2 = x * x;
    const float x4 = x2 * x2;
    const float x8 = x4 * x4;

    P1 = a1*x8*x8 + b1;
    printf("%s%20.10e\n", "Промежуточное вычисление 1 для P1: ", P1);
    P1 = P1 * x8 + c1;
    printf("%s%20.10e\n", "Промежуточное вычисление 2 для P1: ", P1);
    P1 = P1 * x8;
    printf("%s%20.10e\n", "P1 = ", P1);

    P2 = x4*x2 - 1;
    printf("%s%20.10e\n", "Промежуточное вычисление 1 для P2: ", P2);
    P2 = P2*x2 + 1;
    printf("%s%20.10e\n", "Промежуточное вычисление 2 для P2: ", P2);
    P2 = P2*x*a2;
    printf("%s%20.10e\n", "P2 = ", P2);

    printf(
        "%s%f%s%20.10e\n",
        "Для x = ", x, ", P1*P2 равно:", P1*P2
    );

    return 0;
}