// 7.31. Проводится учет выполнения работ разного вида несколькими исполнителями. 
// Требуется хранить информацию об исполнителях (ФИО, адрес, табельный номер),
// о работах (наименование, исполнители, норма на исполнителя/-ей, тариф)
// и о выполненных работах (исполнители, наименование, объем, дата завершения).
// Надо обеспечить возможность получения:
//     - общего списка работ и их исполнителей,
//     - списка выполненных работ на конкретную дату/период (группировка по исполнителям и/или видам работ),
//     - работ, выполненных одним исполнителем,
//     - есть ли работы, выполненные одной и той же группой исполнителей.
// Для выполненных работ должна подсчитываться стоимость работ.


#include "abstracts.hpp"
// #include "types.hpp"

#include <iostream>

int main() {
    // std::cout << ;
    return 0;
}